{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "-": 5,
      "7_": 6,
      "8_": 7,
      "6_": 8,
      "5_": 9,
      "9_": 10,
      "10_": 11,
      "4_": 12,
      "5": 13,
      "4": 14,
      "3": 15,
      "6": 16,
      "2": 17,
      "11_": 18,
      "7": 19,
      "3_": 20,
      "2_": 21,
      "8": 22,
      "12_": 23,
      "1_": 24,
      "9": 25,
      "1": 26,
      "13_": 27,
      "10": 28,
      "14_": 29,
      "20_": 30,
      "11": 31,
      "15_": 32,
      "2_4_": 33,
      "2_2_": 34,
      "12": 35,
      "2_5_": 36,
      "2_3_": 37,
      "1_4_": 38,
      "0_4_": 39,
      "0_3_": 40,
      "1_3_": 41,
      "3_3_": 42,
      "1_5_": 43,
      "0_5_": 44,
      "13": 45,
      "2_6_": 46,
      "0_2_": 47,
      "0_0_": 48,
      "1_6_": 49,
      "1_2_": 50,
      "20": 51,
      "3_5_": 52,
      "2_7_": 53,
      "3_4_": 54,
      "0_6_": 55,
      "14": 56,
      "16_": 57,
      "1_7_": 58,
      "4_4_": 59,
      "1_1_": 60,
      "3_6_": 61,
      "0_7_": 62,
      "2_8_": 63,
      "1_8_": 64,
      "15": 65,
      "3_7_": 66,
      "17_": 67,
      "0_8_": 68,
      "2_9_": 69,
      "3_8_": 70,
      "1_9_": 71,
      "4_5_": 72,
      "4_6_": 73,
      "18_": 74,
      "3_3": 75,
      "5_5_": 76,
      "4_2": 77,
      "0_9_": 78,
      "4_7_": 79,
      "2_10_": 80,
      "2_0_": 81,
      "3_9_": 82,
      "4_4": 83,
      "1_10_": 84,
      "3_2": 85,
      "0_1_": 86,
      "16": 87,
      "4_3": 88,
      "19_": 89,
      "5_2": 90,
      "4_8_": 91,
      "4_0": 92,
      "2_2": 93,
      "3_5": 94,
      "3_4": 95,
      "3_2_": 96,
      "0_10_": 97,
      "5_3": 98,
      "3_10_": 99,
      "2_4": 100,
      "2_11_": 101,
      "4_5": 102,
      "3_0_": 103,
      "1_11_": 104,
      "3_0": 105,
      "3_6": 106,
      "5_0": 107,
      "4_1": 108,
      "5_5": 109,
      "2_3": 110,
      "2_5": 111,
      "4_9_": 112,
      "17": 113,
      "5_4": 114,
      "5_6_": 115,
      "4_6": 116,
      "5_7_": 117,
      "3_1": 118,
      "5_1": 119,
      "6_2": 120,
      "3_11_": 121,
      "3_7": 122,
      "2_6": 123,
      "5_8_": 124,
      "0_11_": 125,
      "6_3": 126,
      "2_12_": 127,
      "4_7": 128,
      "1_12_": 129,
      "4_10_": 130,
      "6_6_": 131,
      "2_1_": 132,
      "4_3_": 133,
      "5_6": 134,
      "4_2_": 135,
      "6_4": 136,
      "2_7": 137,
      "6_0": 138,
      "3_8": 139,
      "18": 140,
      "1_0_": 141,
      "4_8": 142,
      "3_12_": 143,
      "5_9_": 144,
      "5_7": 145,
      "6_1": 146,
      "6_5": 147,
      "0_12_": 148,
      "4_0_": 149,
      "2_13_": 150,
      "7_2": 151,
      "3_1_": 152,
      "6_6": 153,
      "2_8": 154,
      "1_13_": 155,
      "4_11_": 156,
      "2_0": 157,
      "2_1": 158,
      "5_8": 159,
      "7_3": 160,
      "5_10_": 161,
      "3_9": 162,
      "4_9": 163,
      "7_4": 164,
      "19": 165,
      "2_14_": 166,
      "6_7_": 167,
      "6_8_": 168,
      "3_13_": 169,
      "1_14_": 170,
      "7_0": 171,
      "4_12_": 172,
      "7_5": 173,
      "0_13_": 174,
      "7_7_": 175,
      "2_9": 176,
      "7_1": 177,
      "6_7": 178,
      "5_9": 179,
      "5_4_": 180,
      "3_14_": 181,
      "5_11_": 182,
      "5_3_": 183,
      "3_10": 184,
      "4_10": 185,
      "0_14_": 186,
      "6_8": 187,
      "1_4": 188,
      "6_9_": 189,
      "1_5": 190,
      "8_2": 191,
      "7_6": 192,
      "1_3": 193,
      "8_3": 194,
      "4_13_": 195,
      "4_1_": 196,
      "1_6": 197,
      "7_7": 198,
      "5_2_": 199,
      "5_10": 200,
      "2_10": 201,
      "2_20_": 202,
      "5_12_": 203,
      "8_4": 204,
      "4_11": 205,
      "6_10_": 206,
      "6_9": 207,
      "3_11": 208,
      "2_15_": 209,
      "4_14_": 210,
      "8_5": 211,
      "1_20_": 212,
      "1_2": 213,
      "20_20_20_20": 214,
      "5_0_": 215,
      "1_15_": 216,
      "8_1": 217,
      "1_7": 218,
      "7_8_": 219,
      "8_0": 220,
      "3_20_": 221,
      "8_8_": 222,
      "7_8": 223,
      "5_11": 224,
      "8_6": 225,
      "3_15_": 226,
      "2_11": 227,
      "1_8": 228,
      "7_9_": 229,
      "6_10": 230,
      "0_15_": 231,
      "0_20_": 232,
      "5_13_": 233,
      "6_11_": 234,
      "4_12": 235,
      "1_1": 236,
      "4_20_": 237,
      "5_14_": 238,
      "7_9": 239,
      "3_12": 240,
      "9_2": 241,
      "8_7": 242,
      "9_3": 243,
      "8_8": 244,
      "7_10_": 245,
      "4_15_": 246,
      "6_11": 247,
      "6_4_": 248,
      "1_16_": 249,
      "6_5_": 250,
      "5_12": 251,
      "5_1_": 252,
      "9_4": 253,
      "6_12_": 254,
      "1_9": 255,
      "2_16_": 256,
      "9_5": 257,
      "5_20_": 258,
      "2_12": 259,
      "6_3_": 260,
      "7_10": 261,
      "9_1": 262,
      "4_13": 263,
      "3_13": 264,
      "7_11_": 265,
      "6_2_": 266,
      "9_6": 267,
      "9_0": 268,
      "6_13_": 269,
      "7_11": 270,
      "5_13": 271,
      "3_16_": 272,
      "6_12": 273,
      "8_9_": 274,
      "1_10": 275,
      "8_9": 276,
      "5_15_": 277,
      "8_10_": 278,
      "1_17_": 279,
      "2_17_": 280,
      "6_14_": 281,
      "9_7": 282,
      "6_0_": 283,
      "6_20_": 284,
      "0_16_": 285,
      "8_10": 286,
      "7_12_": 287,
      "9_9_": 288,
      "2_13": 289,
      "10_2": 290,
      "1_11": 291,
      "10_3": 292,
      "4_14": 293,
      "10_4": 294,
      "6_13": 295,
      "4_16_": 296,
      "3_14": 297,
      "9_8": 298,
      "8_11_": 299,
      "10_5": 300,
      "7_12": 301,
      "5_14": 302,
      "3_17_": 303,
      "20_20_": 304,
      "8_11": 305,
      "7_13_": 306,
      "7_20_": 307,
      "10_6": 308,
      "9_9": 309,
      "10_1": 310,
      "7_5_": 311,
      "0_17_": 312,
      "1_18_": 313,
      "7_4_": 314,
      "7_6_": 315,
      "7_14_": 316,
      "2_18_": 317,
      "6_1_": 318,
      "10_7": 319,
      "6_15_": 320,
      "8_12_": 321,
      "7_13": 322,
      "5_20": 323,
      "5_16_": 324,
      "2_14": 325,
      "10_0": 326,
      "4_15": 327,
      "4_17_": 328,
      "6_14": 329,
      "7_3_": 330,
      "4_20": 331,
      "1_12": 332,
      "8_20_": 333,
      "5_15": 334,
      "3_18_": 335,
      "8_12": 336,
      "3_15": 337,
      "10_8": 338,
      "9_10_": 339,
      "10_10_": 340,
      "1_0": 341,
      "6_20": 342,
      "7_2_": 343,
      "9_10": 344,
      "7_0_": 345,
      "3_20": 346,
      "11_2": 347,
      "8_13_": 348,
      "7_20": 349,
      "9_11_": 350,
      "9_11": 351,
      "7_14": 352,
      "11_4": 353,
      "2_19_": 354,
      "5_17_": 355,
      "1_13": 356,
      "8_13": 357,
      "1_19_": 358,
      "8_14_": 359,
      "11_3": 360,
      "11_5": 361,
      "4_18_": 362,
      "0_18_": 363,
      "7_15_": 364,
      "8_20": 365,
      "6_15": 366,
      "10_9": 367,
      "2_15": 368,
      "2_20": 369,
      "11_6": 370,
      "6_16_": 371,
      "3_19_": 372,
      "11_7": 373,
      "9_12_": 374,
      "8_5_": 375,
      "8_7_": 376,
      "7_15": 377,
      "11_1": 378,
      "8_14": 379,
      "9_20_": 380,
      "5_18_": 381,
      "10_10": 382,
      "9_12": 383,
      "8_4_": 384,
      "0_19_": 385,
      "8_6_": 386,
      "11_11_": 387,
      "11_8": 388,
      "11_0": 389,
      "5_16": 390,
      "4_16": 391,
      "9_20": 392,
      "8_15_": 393,
      "4_19_": 394,
      "6_17_": 395,
      "9_13_": 396,
      "3_16": 397,
      "9_13": 398,
      "10_11": 399,
      "7_1_": 400,
      "10_11_": 401,
      "9_14_": 402,
      "8_3_": 403,
      "1_14": 404,
      "8_2_": 405,
      "10_12_": 406,
      "8_15": 407,
      "8_0_": 408,
      "10_20_": 409,
      "12_2": 410,
      "7_16_": 411,
      "10_20": 412,
      "5_19_": 413,
      "11_9": 414,
      "12_5": 415,
      "6_16": 416,
      "12_3": 417,
      "12_4": 418,
      "9_14": 419,
      "12_6": 420,
      "10_12": 421,
      "6_18_": 422,
      "2_16": 423,
      "7_17_": 424,
      "12_7": 425,
      "10_13_": 426,
      "11_10": 427,
      "10_14_": 428,
      "12_1": 429,
      "7_16": 430,
      "10_13": 431,
      "1_20": 432,
      "11_20": 433,
      "11_11": 434,
      "9_15_": 435,
      "12_8": 436,
      "11_20_": 437,
      "4_17": 438,
      "1_15": 439,
      "5_17": 440,
      "12_0": 441,
      "12_12_": 442,
      "11_12_": 443,
      "8_16_": 444,
      "9_15": 445,
      "14_14_": 446,
      "6_19_": 447,
      "9_8_": 448,
      "3_17": 449,
      "9_7_": 450,
      "8_1_": 451,
      "11_13_": 452,
      "7_18_": 453,
      "8_16": 454,
      "9_5_": 455,
      "6_17": 456,
      "10_14": 457,
      "12_9": 458,
      "9_6_": 459,
      "9_4_": 460,
      "8_17_": 461,
      "11_14_": 462,
      "7_17": 463,
      "9_3_": 464,
      "8_18_": 465,
      "10_15_": 466,
      "11_12": 467,
      "15_15_": 468,
      "13_13_": 469,
      "12_10": 470,
      "2_17": 471,
      "12_20": 472,
      "13_4": 473,
      "12_20_": 474,
      "13_5": 475,
      "9_0_": 476,
      "7_19_": 477,
      "13_3": 478,
      "13_2": 479,
      "13_6": 480,
      "10_15": 481,
      "11_13": 482,
      "13_7": 483,
      "15_15_15_15": 484,
      "1_16": 485,
      "13_8": 486,
      "2_20_2_20": 487,
      "9_2_": 488,
      "12_14_": 489,
      "12_11": 490,
      "9_16_": 491,
      "0_20_0_20": 492,
      "11_15_": 493,
      "9_16": 494,
      "1_20_1_20": 495,
      "5_18": 496,
      "13_20": 497,
      "4_18": 498,
      "13_20_": 499,
      "0_9_0_8": 500,
      "8_17": 501,
      "11_14": 502,
      "13_1": 503,
      "8_19_": 504,
      "3_20_3_20": 505,
      "9_17_": 506,
      "0_8_0_7": 507,
      "0_7_0_6": 508,
      "12_12": 509,
      "10_8_": 510,
      "10_9_": 511,
      "6_18": 512,
      "3_18": 513,
      "13_9": 514,
      "13_0": 515,
      "12_13_": 516,
      "10_7_": 517,
      "0_10_0_9": 518,
      "4_20_4_20": 519,
      "11_15": 520,
      "10_16_": 521,
      "10_4_": 522,
      "10_6_": 523,
      "13_10": 524,
      "10_5_": 525,
      "14_20_": 526,
      "0_8_0_6": 527,
      "14_4": 528,
      "10_16": 529,
      "5_20_5_20": 530,
      "9_1_": 531,
      "12_15_": 532,
      "7_18": 533,
      "12_13": 534,
      "10_0_": 535,
      "13_11": 536,
      "13_14_": 537,
      "14_6": 538,
      "14_14_14_14": 539,
      "14_20": 540,
      "0_6_0_5": 541,
      "9_17": 542,
      "9_18_": 543,
      "20_20": 544,
      "14_5": 545,
      "0_7_0_5": 546,
      "10_3_": 547,
      "6_20_6_20": 548,
      "14_2": 549,
      "10_17_": 550,
      "1_17": 551,
      "12_14": 552,
      "14_8": 553,
      "10_2_": 554,
      "0_11_0_10": 555,
      "14_3": 556,
      "2_18": 557,
      "13_15_": 558,
      "0_9_0_7": 559,
      "11_16_": 560,
      "14_7": 561,
      "14_9": 562,
      "8_18": 563,
      "9_19_": 564,
      "0_10_0_8": 565,
      "0_6_0_4": 566,
      "7_20_7_20": 567,
      "0_8_0_5": 568,
      "10_17": 569,
      "10_18_": 570,
      "11_17_": 571,
      "0_7_0_4": 572,
      "15_20_": 573,
      "0_12_0_11": 574,
      "14_10": 575,
      "14_1": 576,
      "12_15": 577,
      "13_13": 578,
      "13_12": 579,
      "0_8_0_8": 580,
      "11_16": 581,
      "14_0": 582,
      "11_10_": 583,
      "2_8_0_7": 584,
      "0_9_0_9": 585,
      "12_16_": 586,
      "5_19": 587,
      "14_11": 588,
      "15_20": 589,
      "4_19": 590,
      "2_7_0_6": 591,
      "10_19_": 592,
      "1_10_1_9": 593,
      "8_20_8_20": 594,
      "0_7_0_7": 595,
      "11_7_": 596,
      "11_9_": 597,
      "11_8_": 598,
      "2_10_2_9": 599,
      "1_9_1_8": 600,
      "11_18_": 601,
      "2_6_0_5": 602,
      "1_11_1_10": 603,
      "9_18": 604,
      "0_11_0_9": 605,
      "14_15_": 606,
      "0_5_0_4": 607,
      "0_9_0_6": 608,
      "2_12_2_11": 609,
      "0_10_0_10": 610,
      "13_14": 611,
      "2_9_0_8": 612,
      "2_5_0_4": 613,
      "11_6_": 614,
      "2_6_0_4": 615,
      "3_19": 616,
      "0_5_0_3": 617,
      "0_6_0_6": 618,
      "12_17_": 619,
      "2_9_2_8": 620,
      "2_7_0_5": 621,
      "14_14": 622,
      "1_12_1_11": 623,
      "11_5_": 624,
      "20_20_18_20": 625,
      "11_4_": 626,
      "10_1_": 627,
      "11_0_": 628,
      "6_19": 629,
      "1_8_1_7": 630,
      "0_13_0_12": 631,
      "20_20_16_20": 632,
      "10_20_10_20": 633,
      "7_19": 634,
      "1_10_1_8": 635,
      "9_20_9_20": 636,
      "20_20_17_20": 637,
      "14_12": 638,
      "0_10_0_7": 639,
      "0_6_0_3": 640,
      "0_11_0_11": 641,
      "13_15": 642,
      "2_11_2_10": 643,
      "20_20_15_20": 644,
      "15_2": 645,
      "1_18": 646,
      "0_12_0_10": 647,
      "11_17": 648,
      "11_19_": 649,
      "2_8_0_6": 650,
      "15_8": 651,
      "15_5": 652,
      "1_8_1_6": 653,
      "15_4": 654,
      "14_13": 655,
      "2_10_2_8": 656,
      "15_9": 657,
      "16_20_": 658,
      "12_16": 659,
      "13_16_": 660,
      "15_7": 661,
      "11_20_11_20": 662,
      "2_8_2_7": 663,
      "16_16_": 664,
      "15_6": 665,
      "16_20": 666,
      "2_19": 667,
      "1_7_1_6": 668,
      "1_9_1_7": 669,
      "11_2_": 670,
      "20_20_19_20": 671,
      "10_18": 672,
      "0_14_0_14": 673,
      "2_13_2_12": 674,
      "0_14_0_13": 675,
      "0_15_0_15": 676,
      "0_9_0_5": 677,
      "1_11_1_9": 678,
      "2_10_0_9": 679,
      "11_3_": 680,
      "12_18_": 681,
      "15_3": 682,
      "17_20_": 683,
      "15_11": 684,
      "1_13_1_12": 685,
      "13_17_": 686,
      "0_8_0_4": 687,
      "8_19": 688,
      "15_1": 689,
      "0_7_0_3": 690,
      "2_14_2_13": 691,
      "12_11_": 692,
      "0_13_0_11": 693,
      "12_10_": 694,
      "19_19_": 695,
      "0_5_0_5": 696,
      "12_20_12_20": 697,
      "15_10": 698,
      "3_7_0_6": 699,
      "2_9_0_7": 700,
      "17_17_": 701,
      "2_11_2_9": 702,
      "14_15": 703,
      "0_12_0_12": 704,
      "1_10_1_7": 705,
      "2_7_0_7": 706,
      "3_8_0_7": 707,
      "0_11_0_8": 708,
      "2_7_0_4": 709,
      "14_16_": 710,
      "2_9_2_7": 711,
      "1_7_1_5": 712,
      "1_14_1_13": 713,
      "13_20_13_20": 714,
      "1_13_1_11": 715,
      "3_12_3_11": 716,
      "12_9_": 717,
      "0_12_0_9": 718,
      "2_11_2_11": 719,
      "3_9_0_8": 720,
      "2_12_2_10": 721,
      "1_12_1_10": 722,
      "15_0": 723,
      "2_8_0_8": 724,
      "2_8_0_5": 725,
      "3_7_0_5": 726,
      "0_14_0_12": 727,
      "3_11_3_10": 728,
      "2_5_0_2": 729,
      "1_11_1_11": 730,
      "1_7_0_6": 731,
      "2_11_0_10": 732,
      "3_6_0_5": 733,
      "9_19": 734,
      "12_0_": 735,
      "1_8_1_5": 736,
      "12_8_": 737,
      "2_6_0_6": 738,
      "12_17": 739,
      "13_16": 740,
      "13_18_": 741,
      "2_10_0_8": 742,
      "2_5_0_3": 743,
      "17_20": 744,
      "15_15": 745,
      "12_19_": 746,
      "2_10_2_10": 747,
      "3_9_2_8": 748,
      "2_8_2_6": 749,
      "19_20_": 750,
      "14_20_14_20": 751,
      "0_10_0_6": 752,
      "15_12": 753,
      "3_8_0_6": 754,
      "1_10_1_10": 755,
      "3_13_3_12": 756,
      "2_9_1_8": 757,
      "18_20_": 758,
      "14_17_": 759,
      "2_9_0_9": 760,
      "3_14_3_13": 761,
      "2_13_2_11": 762,
      "2_7_2_6": 763,
      "1_19": 764,
      "11_18": 765,
      "1_9_1_6": 766,
      "12_5_": 767,
      "18_18_": 768,
      "1_9_1_9": 769,
      "12_7_": 770,
      "0_5_0_2": 771,
      "1_8_1_8": 772,
      "3_10_0_9": 773,
      "1_8_0_7": 774,
      "0_13_0_13": 775,
      "2_9_2_9": 776,
      "15_20_15_20": 777,
      "2_6_0_3": 778,
      "2_9_2_6": 779,
      "11_1_": 780,
      "2_4_0_2": 781,
      "3_5_0_3": 782,
      "2_20_0_20": 783,
      "2_11_2_8": 784,
      "2_8_1_7": 785,
      "0_6_0_2": 786,
      "2_6_0_2": 787,
      "12_3_": 788,
      "12_6_": 789,
      "3_10_3_9": 790,
      "1_6_0_5": 791,
      "2_12_2_12": 792,
      "15_13": 793,
      "2_10_2_7": 794,
      "16_6": 795,
      "1_6_1_5": 796,
      "1_12_1_12": 797,
      "12_4_": 798,
      "3_7_0_3": 799,
      "13_19_": 800,
      "1_14_1_12": 801,
      "2_13_2_13": 802,
      "0_15_0_13": 803,
      "1_11_1_8": 804,
      "3_9_0_7": 805,
      "3_10_2_9": 806,
      "2_20_1_20": 807,
      "2_8_0_4": 808,
      "14_18_": 809,
      "2_7_2_5": 810,
      "2_9_0_6": 811,
      "12_2_": 812,
      "0_9_0_4": 813,
      "3_20_0_20": 814,
      "3_11_0_10": 815,
      "4_9_2_8": 816,
      "16_9": 817,
      "0_15_0_14": 818,
      "20_20_14_20": 819,
      "0_11_0_7": 820,
      "0_12_0_8": 821,
      "16_7": 822,
      "2_15_2_14": 823,
      "3_9_3_8": 824,
      "3_9_1_8": 825,
      "0_8_0_3": 826,
      "16_8": 827,
      "2_14_2_12": 828,
      "3_8_0_8": 829,
      "3_6_0_3": 830,
      "4_20_2_20": 831,
      "2_8_2_5": 832,
      "3_6_0_4": 833,
      "13_10_": 834,
      "3_7_0_4": 835,
      "15_14": 836,
      "3_8_2_7": 837,
      "16_5": 838,
      "13_11_": 839,
      "0_14_0_11": 840,
      "2_5_0_5": 841,
      "2_14_2_14": 842,
      "2_12_0_11": 843,
      "20_9": 844,
      "3_8_0_5": 845,
      "1_9_0_8": 846,
      "2_15_2_15": 847,
      "2_7_1_6": 848,
      "1_15_1_14": 849,
      "5_20_3_20": 850,
      "13_12_": 851,
      "2_15_2_13": 852,
      "3_20_2_20": 853,
      "16_10": 854,
      "0_13_0_10": 855,
      "1_10_0_9": 856,
      "4_20_3_20": 857,
      "0_4_0_2": 858,
      "13_17": 859,
      "15_16_": 860,
      "2_10_0_10": 861,
      "3_14_3_12": 862,
      "16_11": 863,
      "3_13_3_11": 864,
      "16_2": 865,
      "3_20_1_20": 866,
      "2_8_1_6": 867,
      "0_10_0_5": 868,
      "18_20": 869,
      "2_10_0_7": 870,
      "16_4": 871,
      "1_7_1_7": 872,
      "20_11": 873,
      "1_12_1_9": 874,
      "2_7_0_2": 875,
      "3_10_0_8": 876,
      "3_15_3_14": 877,
      "3_14_3_14": 878,
      "20_10": 879,
      "10_19": 880,
      "1_13_1_13": 881,
      "5_20_4_20": 882,
      "3_8_2_6": 883,
      "3_10_3_8": 884,
      "2_8_2_8": 885,
      "0_7_0_2": 886,
      "1_7_1_4": 887,
      "20_7": 888,
      "2_11_0_9": 889,
      "20_13": 890,
      "1_6_1_4": 891,
      "14_16": 892,
      "3_10_1_9": 893,
      "1_9_1_5": 894,
      "4_7_0_4": 895,
      "3_11_2_10": 896,
      "3_15_3_15": 897,
      "2_10_1_9": 898,
      "4_10_2_9": 899,
      "0_4_0_3": 900,
      "12_18": 901,
      "3_12_3_10": 902,
      "3_9_0_9": 903,
      "1_7_0_5": 904,
      "3_9_2_7": 905,
      "15_17_": 906,
      "2_11_0_11": 907,
      "3_7_2_6": 908,
      "2_7_0_3": 909,
      "2_12_2_9": 910,
      "1_10_1_6": 911,
      "1_14_1_14": 912,
      "2_7_1_5": 913,
      "2_11_1_10": 914,
      "1_6_0_4": 915,
      "3_11_3_9": 916,
      "3_7_0_7": 917,
      "20_8": 918,
      "6_20_5_20": 919,
      "4_6_0_4": 920,
      "16_20_16_20": 921,
      "20_14": 922,
      "3_8_1_7": 923,
      "3_11_1_10": 924,
      "14_19_": 925,
      "16_3": 926,
      "3_12_0_11": 927,
      "16_1": 928,
      "2_9_1_7": 929,
      "4_8_2_7": 930,
      "20_6": 931,
      "1_15_1_13": 932,
      "4_12_4_11": 933,
      "20_12": 934,
      "4_11_2_10": 935,
      "14_13_": 936,
      "3_12_2_11": 937,
      "2_10_2_6": 938,
      "3_9_3_7": 939,
      "2_4_0_3": 940,
      "13_9_": 941,
      "3_7_1_6": 942,
      "4_11_4_10": 943,
      "13_0_": 944,
      "1_5_0_4": 945,
      "4_14_4_13": 946,
      "11_19": 947,
      "14_0_": 948,
      "3_11_3_11": 949,
      "1_8_0_6": 950,
      "3_12_3_12": 951,
      "3_13_3_13": 952,
      "3_9_1_7": 953,
      "20_15": 954,
      "4_12_2_11": 955,
      "4_8_0_6": 956,
      "1_13_1_10": 957,
      "4_20_1_20": 958,
      "13_8_": 959,
      "16_12": 960,
      "3_11_0_9": 961,
      "5_20_2_20": 962,
      "7_20_6_20": 963,
      "3_10_2_8": 964,
      "2_14_2_11": 965,
      "16_13": 966,
      "20_5": 967,
      "3_9_0_6": 968,
      "1_8_1_4": 969,
      "0_11_0_6": 970,
      "4_20_0_20": 971,
      "0_9_0_3": 972,
      "6_20_4_20": 973,
      "2_12_0_10": 974,
      "2_8_1_5": 975,
      "1_20_0_20": 976,
      "4_10_0_9": 977,
      "4_8_0_7": 978,
      "2_13_2_10": 979,
      "8_20_7_20": 980,
      "1_9_0_7": 981,
      "3_7_1_5": 982,
      "4_7_0_6": 983,
      "4_13_4_12": 984,
      "1_11_1_7": 985,
      "19_20": 986,
      "7_20_5_20": 987,
      "13_7_": 988,
      "1_14_1_11": 989,
      "3_6_0_6": 990,
      "2_9_2_5": 991,
      "1_10_0_8": 992,
      "1_11_0_10": 993,
      "1_6_0_3": 994,
      "13_4_": 995,
      "14_12_": 996,
      "3_8_1_6": 997,
      "1_16_1_15": 998,
      "3_11_3_8": 999,
      "2_6_1_5": 1000,
      "20_16": 1001,
      "0_4_0_4": 1002,
      "2_9_0_5": 1003,
      "1_5_0_3": 1004,
      "15_19_": 1005,
      "2_7_2_4": 1006,
      "1_7_0_4": 1007,
      "20_4": 1008,
      "7_20_4_20": 1009,
      "4_9_2_7": 1010,
      "3_8_3_7": 1011,
      "8_20_6_20": 1012,
      "4_9_0_7": 1013,
      "4_9_0_8": 1014,
      "20_20_13_20": 1015,
      "8_20_5_20": 1016,
      "3_7_2_5": 1017,
      "5_20_1_20": 1018,
      "4_15_4_15": 1019,
      "3_10_1_8": 1020,
      "3_5_0_4": 1021,
      "15_18_": 1022,
      "17_11": 1023,
      "13_6_": 1024,
      "3_10_3_10": 1025,
      "2_12_2_8": 1026,
      "3_9_2_9": 1027,
      "1_15_1_15": 1028,
      "3_10_0_7": 1029,
      "17_6": 1030,
      "3_15_3_13": 1031,
      "6_20_2_20": 1032,
      "2_12_1_11": 1033,
      "14_20_11_20": 1034,
      "1_6_1_6": 1035,
      "2_11_0_8": 1036,
      "13_18": 1037,
      "3_8_0_3": 1038,
      "17_10": 1039,
      "3_10_3_7": 1040,
      "14_17": 1041,
      "1_9_0_6": 1042,
      "3_10_0_10": 1043,
      "6_20_3_20": 1044,
      "13_20_11_20": 1045,
      "2_7_1_4": 1046,
      "13_5_": 1047,
      "2_11_2_7": 1048,
      "5_20_0_20": 1049,
      "13_3_": 1050,
      "17_7": 1051,
      "4_8_2_6": 1052,
      "4_12_4_10": 1053,
      "0_14_0_10": 1054,
      "1_11_1_6": 1055,
      "2_7_2_7": 1056,
      "20_2": 1057,
      "3_8_2_5": 1058,
      "2_10_1_8": 1059,
      "20_1": 1060,
      "3_16_3_15": 1061,
      "12_1_": 1062,
      "14_11_": 1063,
      "4_9_1_8": 1064,
      "15_16": 1065,
      "15_14_": 1066,
      "14_10_": 1067,
      "17_8": 1068,
      "1_8_0_5": 1069,
      "2_10_0_6": 1070,
      "4_10_2_8": 1071,
      "4_7_0_5": 1072,
      "0_13_0_9": 1073,
      "13_2_": 1074,
      "20_17": 1075,
      "4_15_4_14": 1076,
      "17_9": 1077,
      "2_6_1_4": 1078,
      "4_10_1_9": 1079,
      "3_12_3_9": 1080,
      "12_19": 1081,
      "1_12_1_8": 1082,
      "1_6_0_6": 1083,
      "2_9_1_6": 1084,
      "0_16_0_15": 1085,
      "4_11_2_9": 1086,
      "2_11_1_9": 1087,
      "2_13_0_12": 1088,
      "2_4_0_4": 1089,
      "3_12_1_11": 1090,
      "10_20_9_20": 1091,
      "14_8_": 1092,
      "3_10_2_10": 1093,
      "4_14_4_12": 1094,
      "16_0": 1095,
      "1_8_0_8": 1096,
      "3_12_0_10": 1097,
      "1_9_1_4": 1098,
      "1_12_0_11": 1099,
      "1_10_1_5": 1100,
      "3_11_2_9": 1101,
      "1_16_1_14": 1102,
      "4_7_2_6": 1103,
      "2_16_2_15": 1104,
      "17_5": 1105,
      "3_9_1_6": 1106,
      "14_9_": 1107,
      "2_16_2_14": 1108,
      "4_10_3_9": 1109,
      "0_10_0_4": 1110,
      "1_7_0_7": 1111,
      "9_20_8_20": 1112,
      "17_20_17_20": 1113,
      "16_14": 1114,
      "3_8_0_4": 1115,
      "3_14_2_13": 1116,
      "3_14_3_11": 1117,
      "0_16_0_14": 1118,
      "4_8_1_7": 1119,
      "3_9_0_5": 1120,
      "7_20_3_20": 1121,
      "4_13_4_11": 1122,
      "4_12_3_11": 1123,
      "1_17_1_16": 1124,
      "20_3": 1125,
      "12_20_11_20": 1126,
      "14_20_12_20": 1127,
      "11_20_9_20": 1128,
      "1_13_1_9": 1129,
      "15_20_11_20": 1130,
      "3_5_0_5": 1131,
      "2_6_2_5": 1132,
      "5_14_5_13": 1133,
      "2_9_0_4": 1134,
      "11_20_10_20": 1135,
      "15_20_12_20": 1136,
      "20_20_12_20": 1137,
      "2_17_2_16": 1138,
      "1_6_1_3": 1139,
      "2_10_2_5": 1140,
      "3_8_1_5": 1141,
      "3_9_2_6": 1142,
      "4_11_1_10": 1143,
      "1_11_0_9": 1144,
      "17_3": 1145,
      "3_8_3_6": 1146,
      "3_11_0_8": 1147,
      "4_11_0_10": 1148,
      "8_20_4_20": 1149,
      "2_12_0_12": 1150,
      "17_4": 1151,
      "3_9_3_6": 1152,
      "5_10_2_9": 1153,
      "4_7_2_5": 1154,
      "12_20_10_20": 1155,
      "17_12": 1156,
      "3_11_2_11": 1157,
      "3_11_1_9": 1158,
      "3_7_1_4": 1159,
      "4_10_1_8": 1160,
      "9_20_7_20": 1161,
      "3_13_0_12": 1162,
      "3_9_1_9": 1163,
      "0_12_0_7": 1164,
      "3_11_0_11": 1165,
      "1_7_1_3": 1166,
      "1_9_0_9": 1167,
      "2_10_1_7": 1168,
      "5_9_2_8": 1169,
      "3_14_0_13": 1170,
      "1_15_1_12": 1171,
      "3_16_3_14": 1172,
      "2_13_0_11": 1173,
      "2_8_1_8": 1174,
      "10_20_8_20": 1175,
      "2_9_1_9": 1176,
      "4_10_0_8": 1177,
      "1_5_1_4": 1178,
      "4_10_4_9": 1179,
      "4_12_1_11": 1180,
      "3_17_3_16": 1181,
      "4_13_2_12": 1182,
      "4_14_4_14": 1183,
      "1_8_0_4": 1184,
      "3_13_1_12": 1185,
      "9_20_6_20": 1186,
      "4_6_0_5": 1187,
      "0_15_0_12": 1188,
      "13_20_12_20": 1189,
      "3_6_1_5": 1190,
      "1_8_1_3": 1191,
      "3_9_3_9": 1192,
      "2_8_0_3": 1193,
      "7_20_2_20": 1194,
      "11_20_8_20": 1195,
      "17_20_15_20": 1196,
      "4_11_4_9": 1197,
      "17_2": 1198,
      "18_8": 1199,
      "16_15": 1200,
      "2_13_2_9": 1201,
      "17_13": 1202,
      "3_8_2_8": 1203,
      "3_13_2_12": 1204,
      "8_20_3_20": 1205,
      "2_14_0_13": 1206,
      "1_12_1_7": 1207,
      "14_20_13_20": 1208,
      "2_13_1_12": 1209,
      "14_18": 1210,
      "3_10_2_7": 1211,
      "3_13_3_10": 1212,
      "1_18_1_17": 1213,
      "0_8_0_2": 1214,
      "2_12_1_10": 1215,
      "2_8_2_4": 1216,
      "2_11_1_11": 1217,
      "4_9_3_8": 1218,
      "3_12_2_10": 1219,
      "13_20_9_20": 1220,
      "1_11_1_5": 1221,
      "16_17_": 1222,
      "18_20_15_20": 1223,
      "3_13_2_11": 1224,
      "5_10_3_9": 1225,
      "3_13_0_11": 1226,
      "2_20_2_19": 1227,
      "3_10_0_6": 1228,
      "15_20_13_20": 1229,
      "15_13_": 1230,
      "1_14_1_10": 1231,
      "1_7_0_3": 1232,
      "3_10_1_7": 1233,
      "2_10_1_10": 1234,
      "1_10_0_7": 1235,
      "3_9_0_3": 1236,
      "2_15_2_12": 1237,
      "5_12_5_11": 1238,
      "5_15_5_15": 1239,
      "0_11_0_5": 1240,
      "18_11": 1241,
      "1_20_1_18": 1242,
      "4_8_1_6": 1243,
      "4_8_2_5": 1244,
      "2_8_1_4": 1245,
      "3_12_2_12": 1246,
      "4_11_0_9": 1247,
      "11_20_7_20": 1248,
      "4_15_4_13": 1249,
      "5_11_3_10": 1250,
      "0_13_0_8": 1251,
      "3_11_2_8": 1252,
      "4_8_0_5": 1253,
      "12_20_8_20": 1254,
      "5_11_2_10": 1255,
      "1_20_1_19": 1256,
      "4_9_2_6": 1257,
      "5_10_2_8": 1258,
      "4_10_3_8": 1259,
      "13_20_10_20": 1260,
      "20_18": 1261,
      "18_6": 1262,
      "18_9": 1263,
      "3_12_3_8": 1264,
      "3_8_1_8": 1265,
      "12_20_9_20": 1266,
      "3_13_1_11": 1267,
      "0_17_0_16": 1268,
      "4_11_3_10": 1269,
      "16_20_14_20": 1270,
      "9_20_5_20": 1271,
      "3_6_1_4": 1272,
      "4_9_1_7": 1273,
      "15_20_14_20": 1274,
      "4_11_2_11": 1275,
      "2_12_0_9": 1276,
      "18_5": 1277,
      "0_12_0_6": 1278,
      "18_10": 1279,
      "15_17": 1280,
      "1_17_1_15": 1281,
      "2_20_2_18": 1282,
      "14_3_": 1283,
      "15_12_": 1284,
      "1_16_1_13": 1285,
      "4_9_2_9": 1286,
      "5_12_2_11": 1287,
      "20_20_11_20": 1288,
      "4_12_0_11": 1289,
      "3_10_2_6": 1290,
      "4_12_2_10": 1291,
      "4_7_1_5": 1292,
      "14_20_10_20": 1293,
      "4_10_4_8": 1294,
      "4_10_2_10": 1295,
      "14_6_": 1296,
      "14_7_": 1297,
      "2_8_0_2": 1298,
      "3_10_3_6": 1299,
      "4_16_4_15": 1300,
      "3_10_1_10": 1301,
      "4_8_0_4": 1302,
      "17_1": 1303,
      "19_8": 1304,
      "2_14_2_10": 1305,
      "4_11_1_9": 1306,
      "5_15_5_14": 1307,
      "3_7_2_4": 1308,
      "3_8_1_4": 1309,
      "4_12_4_12": 1310,
      "5_9_0_8": 1311,
      "4_11_2_8": 1312,
      "5_13_5_11": 1313,
      "4_9_0_6": 1314,
      "14_4_": 1315,
      "3_12_1_10": 1316,
      "3_14_1_13": 1317,
      "3_9_2_5": 1318,
      "13_19": 1319,
      "4_9_0_9": 1320,
      "2_7_1_7": 1321,
      "20_13_": 1322,
      "4_14_2_13": 1323,
      "5_14_5_12": 1324,
      "5_9_2_7": 1325,
      "17_14": 1326,
      "10_20_6_20": 1327,
      "1_13_1_8": 1328,
      "6_20_1_20": 1329,
      "2_11_2_6": 1330,
      "15_0_": 1331,
      "5_12_3_11": 1332,
      "4_12_4_9": 1333,
      "4_7_0_7": 1334,
      "20_0": 1335,
      "5_11_4_10": 1336,
      "14_5_": 1337,
      "4_9_1_6": 1338,
      "2_9_2_4": 1339,
      "13_1_": 1340,
      "2_12_2_7": 1341,
      "2_9_1_5": 1342,
      "1_4_0_3": 1343,
      "3_6_2_5": 1344,
      "16_20_15_20": 1345,
      "4_13_4_10": 1346,
      "3_8_3_8": 1347,
      "3_14_0_14": 1348,
      "4_13_4_13": 1349,
      "4_7_1_6": 1350,
      "4_8_0_8": 1351,
      "16_20_13_20": 1352,
      "1_10_0_10": 1353,
      "1_11_0_11": 1354,
      "2_14_0_12": 1355,
      "4_10_2_7": 1356,
      "4_8_1_5": 1357,
      "4_16_4_14": 1358,
      "4_13_3_12": 1359,
      "2_16_2_13": 1360,
      "3_11_0_7": 1361,
      "3_7_2_7": 1362,
      "0_16_0_13": 1363,
      "18_7": 1364,
      "4_10_0_10": 1365,
      "1_13_0_12": 1366,
      "3_10_1_6": 1367,
      "4_9_4_8": 1368,
      "5_9_1_8": 1369,
      "3_12_2_9": 1370,
      "4_14_0_14": 1371,
      "15_11_": 1372,
      "17_20_14_20": 1373,
      "3_9_1_5": 1374,
      "16_18_": 1375,
      "4_12_2_12": 1376,
      "5_13_5_12": 1377,
      "4_9_3_7": 1378,
      "5_9_3_8": 1379,
      "5_15_5_13": 1380,
      "1_6_0_2": 1381,
      "2_10_0_5": 1382,
      "0_14_0_9": 1383,
      "1_5_0_2": 1384,
      "1_5_0_5": 1385,
      "2_10_1_6": 1386,
      "5_10_3_8": 1387,
      "3_7_3_6": 1388,
      "3_14_3_10": 1389,
      "10_20_7_20": 1390,
      "4_14_4_11": 1391,
      "3_11_1_8": 1392,
      "3_6_0_2": 1393,
      "4_6_0_2": 1394,
      "5_11_3_9": 1395,
      "2_7_1_3": 1396,
      "1_11_0_8": 1397,
      "2_13_1_11": 1398,
      "3_5_0_2": 1399,
      "5_10_1_9": 1400,
      "1_17_1_14": 1401,
      "1_9_0_5": 1402,
      "8_20_2_20": 1403,
      "3_11_1_11": 1404,
      "2_14_1_13": 1405,
      "3_12_0_12": 1406,
      "5_8_2_7": 1407,
      "18_13": 1408,
      "2_20_2_17": 1409,
      "4_11_3_9": 1410,
      "3_7_1_7": 1411,
      "2_12_1_12": 1412,
      "2_11_0_7": 1413,
      "20_14_": 1414,
      "2_11_1_8": 1415,
      "2_18_2_17": 1416,
      "1_18_1_16": 1417,
      "6_20_0_20": 1418,
      "18_4": 1419,
      "20_15_": 1420,
      "2_6_1_3": 1421,
      "4_10_0_7": 1422,
      "1_12_0_10": 1423,
      "2_17_2_15": 1424,
      "2_13_0_13": 1425,
      "16_20_12_20": 1426,
      "18_2": 1427,
      "4_11_4_11": 1428,
      "4_14_3_13": 1429,
      "0_15_0_11": 1430,
      "3_8_2_4": 1431,
      "3_20_3_18": 1432,
      "20_0_": 1433,
      "3_15_3_12": 1434,
      "0_20_0_17": 1435,
      "19_9": 1436,
      "4_17_4_16": 1437,
      "4_9_2_5": 1438,
      "0_17_0_15": 1439,
      "12_20_7_20": 1440,
      "15_10_": 1441,
      "4_13_2_11": 1442,
      "3_11_3_7": 1443,
      "0_10_0_3": 1444,
      "5_8_0_5": 1445,
      "18_1": 1446,
      "3_6_1_3": 1447,
      "13_20_8_20": 1448,
      "4_17_4_15": 1449,
      "3_20_3_19": 1450,
      "2_6_2_4": 1451,
      "4_10_1_7": 1452,
      "4_9_0_5": 1453,
      "18_12": 1454,
      "3_13_2_13": 1455,
      "3_14_0_12": 1456,
      "3_12_0_9": 1457,
      "4_10_0_6": 1458,
      "9_20_3_20": 1459,
      "3_7_0_2": 1460,
      "2_17_2_14": 1461,
      "3_13_3_9": 1462,
      "4_14_1_13": 1463,
      "4_7_2_4": 1464,
      "16_19_": 1465,
      "3_10_0_5": 1466,
      "0_18_0_16": 1467,
      "5_14_3_13": 1468,
      "19_6": 1469,
      "3_12_3_7": 1470,
      "4_12_1_10": 1471,
      "11_20_5_20": 1472,
      "2_5_1_4": 1473,
      "4_8_3_6": 1474,
      "1_12_1_6": 1475,
      "3_8_3_5": 1476,
      "5_12_2_10": 1477,
      "18_20_18_20": 1478,
      "1_15_1_11": 1479,
      "5_13_3_12": 1480,
      "4_11_0_11": 1481,
      "14_2_": 1482,
      "2_9_0_3": 1483,
      "3_18_3_17": 1484,
      "4_11_4_8": 1485,
      "3_7_1_3": 1486,
      "6_15_6_15": 1487,
      "11_20_6_20": 1488,
      "5_11_1_10": 1489,
      "3_11_2_7": 1490,
      "2_15_0_15": 1491,
      "4_10_2_6": 1492,
      "4_12_3_10": 1493,
      "1_14_1_9": 1494,
      "5_16_5_15": 1495,
      "18_3": 1496,
      "1_12_0_12": 1497,
      "1_14_0_13": 1498,
      "16_20_11_20": 1499,
      "4_8_3_7": 1500,
      "3_16_3_13": 1501,
      "10_20_5_20": 1502,
      "5_11_2_9": 1503,
      "19_11": 1504,
      "1_10_1_4": 1505,
      "4_9_0_4": 1506,
      "1_20_1_17": 1507,
      "2_18_2_16": 1508,
      "3_13_0_13": 1509,
      "7_20_0_20": 1510,
      "4_10_1_10": 1511,
      "2_9_1_4": 1512,
      "4_13_0_12": 1513,
      "3_15_2_13": 1514,
      "19_20_16_20": 1515,
      "20_12_": 1516,
      "2_13_0_10": 1517,
      "5_12_4_11": 1518,
      "2_12_0_8": 1519,
      "5_8_2_6": 1520,
      "3_10_2_5": 1521,
      "4_11_3_11": 1522,
      "0_17_0_14": 1523,
      "1_5_1_3": 1524,
      "5_8_0_7": 1525,
      "2_12_1_9": 1526,
      "3_14_2_12": 1527,
      "5_14_2_13": 1528,
      "3_6_2_4": 1529,
      "4_13_1_12": 1530,
      "7_20_1_20": 1531,
      "2_13_2_8": 1532,
      "1_16_1_16": 1533,
      "4_9_1_5": 1534,
      "3_4_0_3": 1535,
      "2_14_2_9": 1536,
      "5_12_5_10": 1537,
      "2_14_0_14": 1538,
      "19_10": 1539,
      "3_18_3_16": 1540,
      "0_9_0_2": 1541,
      "20_19": 1542,
      "4_9_3_6": 1543,
      "18_20_14_20": 1544,
      "1_7_0_2": 1545,
      "3_12_1_12": 1546,
      "4_12_4_8": 1547,
      "0_4_0_0": 1548,
      "4_12_0_12": 1549,
      "5_7_0_5": 1550,
      "0_11_0_4": 1551,
      "16_14_": 1552,
      "19_20_15_20": 1553,
      "2_8_1_3": 1554,
      "3_12_1_9": 1555,
      "1_9_0_4": 1556,
      "3_13_0_10": 1557,
      "1_10_0_6": 1558,
      "17_0": 1559,
      "1_4_0_2": 1560,
      "4_13_2_13": 1561,
      "4_20_4_19": 1562,
      "15_8_": 1563,
      "3_20_3_17": 1564,
      "5_13_2_12": 1565,
      "15_9_": 1566,
      "5_12_3_10": 1567,
      "3_17_3_15": 1568,
      "4_10_3_10": 1569,
      "4_9_1_9": 1570,
      "1_8_0_3": 1571,
      "3_9_0_4": 1572,
      "1_9_1_3": 1573,
      "0_5_0_0": 1574,
      "14_19": 1575,
      "15_20_10_20": 1576,
      "3_15_2_14": 1577,
      "3_8_1_3": 1578,
      "4_12_0_10": 1579,
      "4_14_4_10": 1580,
      "4_8_2_8": 1581,
      "19_7": 1582,
      "2_14_1_12": 1583,
      "3_16_3_16": 1584,
      "18_14": 1585,
      "4_15_2_13": 1586,
      "5_20_5_19": 1587,
      "0_20_0_19": 1588,
      "5_9_2_6": 1589,
      "4_12_2_9": 1590,
      "0_20_0_18": 1591,
      "5_14_5_14": 1592,
      "5_20_5_18": 1593,
      "2_16_2_16": 1594,
      "3_9_3_5": 1595,
      "4_12_1_12": 1596,
      "19_12": 1597,
      "0_13_0_7": 1598,
      "2_5_1_3": 1599,
      "4_5_0_4": 1600,
      "2_6_1_6": 1601,
      "5_10_4_9": 1602,
      "4_12_3_12": 1603,
      "5_10_0_9": 1604,
      "4_11_3_8": 1605,
      "5_11_3_8": 1606,
      "4_16_4_13": 1607,
      "4_8_2_4": 1608,
      "15_7_": 1609,
      "3_11_3_6": 1610,
      "4_7_1_4": 1611,
      "2_15_2_11": 1612,
      "4_11_1_11": 1613,
      "5_11_3_11": 1614,
      "15_5_": 1615,
      "5_13_2_11": 1616,
      "17_20_13_20": 1617,
      "4_8_1_8": 1618,
      "5_12_1_11": 1619,
      "9_20_4_20": 1620,
      "2_3_0_2": 1621,
      "2_11_0_6": 1622,
      "2_11_1_7": 1623,
      "5_10_1_8": 1624,
      "3_14_0_11": 1625,
      "2_10_0_4": 1626,
      "5_10_3_7": 1627,
      "17_19_": 1628,
      "1_20_1_16": 1629,
      "4_14_2_12": 1630,
      "5_11_5_10": 1631,
      "5_8_3_7": 1632,
      "4_7_0_2": 1633,
      "2_11_2_5": 1634,
      "4_11_2_7": 1635,
      "4_14_3_12": 1636,
      "20_11_": 1637,
      "3_12_0_8": 1638,
      "17_15": 1639,
      "4_11_0_8": 1640,
      "4_6_0_6": 1641,
      "3_10_1_5": 1642,
      "4_9_4_7": 1643,
      "5_13_4_12": 1644,
      "0_18_0_17": 1645,
      "1_19_1_17": 1646,
      "19_5": 1647,
      "16_16": 1648,
      "19_20_14_20": 1649,
      "17_18_": 1650,
      "4_14_2_14": 1651,
      "2_18_2_15": 1652,
      "3_15_0_15": 1653,
      "4_7_2_7": 1654,
      "17_16": 1655,
      "2_10_2_4": 1656,
      "2_6_2_6": 1657,
      "4_15_2_14": 1658,
      "5_10_2_7": 1659,
      "1_13_0_11": 1660,
      "5_13_3_11": 1661,
      "4_20_4_18": 1662,
      "5_9_3_7": 1663,
      "16_12_": 1664,
      "2_15_0_14": 1665,
      "3_17_3_14": 1666,
      "5_10_0_8": 1667,
      "3_14_1_12": 1668,
      "19_13": 1669,
      "3_13_3_8": 1670,
      "3_6_1_6": 1671,
      "6_12_4_11": 1672,
      "15_18": 1673,
      "1_4_0_4": 1674,
      "3_13_2_10": 1675,
      "2_14_0_11": 1676,
      "3_8_0_2": 1677,
      "5_12_0_11": 1678,
      "4_7_0_3": 1679,
      "5_14_3_14": 1680,
      "3_9_2_4": 1681,
      "4_11_4_7": 1682,
      "5_12_3_12": 1683,
      "5_11_0_10": 1684,
      "0_16_0_16": 1685,
      "4_15_0_15": 1686,
      "19_2": 1687,
      "3_11_0_6": 1688,
      "4_10_3_7": 1689,
      "2_10_1_5": 1690,
      "3_14_2_14": 1691,
      "5_16_5_14": 1692,
      "0_3_0_2": 1693,
      "4_10_1_6": 1694,
      "14_20_9_20": 1695,
      "2_12_2_6": 1696,
      "3_13_1_13": 1697,
      "3_14_3_9": 1698,
      "5_17_5_16": 1699,
      "2_19_2_17": 1700,
      "20_16_": 1701,
      "2_13_1_10": 1702,
      "4_10_4_7": 1703,
      "5_13_4_11": 1704,
      "4_13_0_11": 1705,
      "4_5_0_2": 1706,
      "2_13_1_13": 1707,
      "4_13_2_10": 1708,
      "4_6_1_4": 1709,
      "4_14_0_13": 1710,
      "3_15_0_14": 1711,
      "4_13_1_11": 1712,
      "5_11_2_8": 1713,
      "5_14_5_11": 1714,
      "15_3_": 1715,
      "4_10_4_10": 1716,
      "4_6_2_5": 1717,
      "5_9_1_7": 1718,
      "16_17": 1719,
      "20_10_": 1720,
      "2_14_2_8": 1721,
      "4_6_0_3": 1722,
      "6_11_3_10": 1723,
      "6_14_6_13": 1724,
      "4_13_3_11": 1725,
      "5_13_5_10": 1726,
      "6_15_6_14": 1727,
      "0_16_0_12": 1728,
      "5_12_1_10": 1729,
      "4_15_3_14": 1730,
      "4_13_3_13": 1731,
      "4_6_1_5": 1732,
      "0_6_0_0": 1733,
      "5_8_0_6": 1734,
      "3_14_2_11": 1735,
      "2_7_2_3": 1736,
      "4_12_0_9": 1737,
      "4_8_1_4": 1738,
      "4_20_4_17": 1739,
      "16_15_": 1740,
      "2_12_1_8": 1741,
      "4_13_4_9": 1742,
      "6_9_2_8": 1743,
      "19_3": 1744,
      "1_13_1_7": 1745,
      "4_10_2_5": 1746,
      "18_20_16_20": 1747,
      "1_19_1_18": 1748,
      "2_15_1_14": 1749,
      "4_14_2_11": 1750,
      "12_20_6_20": 1751,
      "13_20_7_20": 1752,
      "5_14_4_13": 1753,
      "19_4": 1754,
      "4_12_2_8": 1755,
      "6_20_6_18": 1756,
      "5_13_1_12": 1757,
      "3_19_3_17": 1758,
      "4_18_4_16": 1759,
      "5_12_2_9": 1760,
      "4_9_3_9": 1761,
      "4_15_4_12": 1762,
      "5_15_5_12": 1763,
      "5_9_4_8": 1764,
      "4_8_1_3": 1765,
      "1_12_0_9": 1766,
      "2_4_0_0": 1767,
      "3_15_1_14": 1768,
      "3_9_1_4": 1769,
      "1_5_1_5": 1770,
      "2_7_1_2": 1771,
      "4_11_1_8": 1772,
      "5_14_3_12": 1773,
      "20_20_10_20": 1774,
      "17_20_16_20": 1775,
      "19_20_17_20": 1776,
      "1_14_1_8": 1777,
      "4_11_0_7": 1778,
      "16_13_": 1779,
      "4_9_2_4": 1780,
      "5_15_4_13": 1781,
      "1_16_1_12": 1782,
      "2_14_1_11": 1783,
      "6_12_3_11": 1784,
      "1_7_1_2": 1785,
      "5_9_0_7": 1786,
      "0_20_0_16": 1787,
      "17_20_11_20": 1788,
      "4_10_3_6": 1789,
      "0_12_0_5": 1790,
      "5_13_5_13": 1791,
      "2_13_2_7": 1792,
      "5_8_3_6": 1793,
      "5_11_1_9": 1794,
      "4_8_0_3": 1795,
      "5_8_1_6": 1796,
      "3_4_0_2": 1797,
      "20_17_": 1798,
      "15_6_": 1799,
      "5_17_5_15": 1800,
      "8_20_1_20": 1801,
      "17_20_12_20": 1802,
      "4_14_1_12": 1803,
      "0_14_0_8": 1804,
      "5_11_2_11": 1805,
      "5_8_2_5": 1806,
      "6_10_2_9": 1807,
      "15_4_": 1808,
      "2_8_2_3": 1809,
      "5_14_4_12": 1810,
      "5_7_0_2": 1811,
      "0_20_0_15": 1812,
      "2_5_0_0": 1813,
      "3_12_2_8": 1814,
      "5_12_3_9": 1815,
      "3_7_3_5": 1816,
      "1_13_0_13": 1817,
      "2_15_2_10": 1818,
      "3_11_1_7": 1819,
      "2_15_0_13": 1820,
      "2_15_1_13": 1821,
      "3_10_0_4": 1822,
      "4_10_0_4": 1823,
      "16_11_": 1824,
      "4_8_0_2": 1825,
      "6_9_3_8": 1826,
      "1_10_0_5": 1827,
      "5_13_5_9": 1828,
      "3_15_0_13": 1829,
      "4_9_1_4": 1830,
      "0_15_0_10": 1831,
      "2_17_2_13": 1832,
      "2_9_0_2": 1833,
      "4_16_4_16": 1834,
      "4_18_4_17": 1835,
      "5_16_5_13": 1836,
      "5_9_3_6": 1837,
      "4_15_3_13": 1838,
      "1_17_1_13": 1839,
      "5_14_1_13": 1840,
      "3_15_3_11": 1841,
      "4_13_4_8": 1842,
      "10_20_3_20": 1843,
      "5_14_2_12": 1844,
      "5_8_1_5": 1845,
      "5_9_2_9": 1846,
      "14_1_": 1847,
      "18_15": 1848,
      "3_15_1_13": 1849,
      "5_9_2_5": 1850,
      "6_14_6_14": 1851,
      "3_10_3_5": 1852,
      "5_13_3_13": 1853,
      "6_12_2_11": 1854,
      "5_11_1_8": 1855,
      "3_15_2_15": 1856,
      "5_8_1_7": 1857,
      "6_10_3_9": 1858,
      "6_11_2_10": 1859,
      "5_9_3_5": 1860,
      "0_19_0_17": 1861,
      "10_20_4_20": 1862,
      "13_20_6_20": 1863,
      "4_12_3_9": 1864,
      "5_11_3_7": 1865,
      "20_19_": 1866,
      "5_11_4_9": 1867,
      "5_20_5_17": 1868,
      "4_10_0_5": 1869,
      "4_13_1_13": 1870,
      "4_7_1_3": 1871,
      "6_14_2_13": 1872,
      "3_7_2_3": 1873,
      "6_17_6_16": 1874,
      "6_11_4_10": 1875,
      "6_10_2_8": 1876,
      "19_14": 1877,
      "2_20_2_16": 1878,
      "4_13_1_10": 1879,
      "5_12_5_12": 1880,
      "0_3_0_3": 1881,
      "20_18_": 1882,
      "6_13_3_12": 1883,
      "8_20_0_20": 1884,
      "0_7_0_0": 1885,
      "1_18_1_15": 1886,
      "2_17_2_17": 1887,
      "5_12_2_12": 1888,
      "5_13_3_10": 1889,
      "5_11_5_9": 1890,
      "5_7_0_4": 1891,
      "5_9_0_5": 1892,
      "3_5_1_4": 1893,
      "4_14_0_11": 1894,
      "4_6_2_4": 1895,
      "6_20_6_17": 1896,
      "3_19_3_18": 1897,
      "6_14_4_13": 1898,
      "3_8_2_3": 1899,
      "3_16_2_15": 1900,
      "4_11_3_7": 1901,
      "18_0": 1902,
      "5_13_0_12": 1903,
      "9_20_2_20": 1904,
      "15_19": 1905,
      "6_11_2_9": 1906,
      "6_10_3_8": 1907,
      "7_20_7_18": 1908,
      "4_14_3_14": 1909,
      "5_10_1_7": 1910,
      "5_10_3_10": 1911,
      "15_2_": 1912,
      "2_13_0_9": 1913,
      "4_11_1_7": 1914,
      "1_11_0_7": 1915,
      "20_20_9_20": 1916,
      "2_16_1_15": 1917,
      "5_15_4_14": 1918,
      "3_14_1_14": 1919,
      "4_15_1_13": 1920,
      "5_8_0_4": 1921,
      "3_18_3_15": 1922,
      "5_7_2_6": 1923,
      "1_6_1_2": 1924,
      "0_18_0_15": 1925,
      "2_11_1_6": 1926,
      "3_14_1_11": 1927,
      "5_12_5_9": 1928,
      "5_9_1_6": 1929,
      "3_10_0_3": 1930,
      "4_11_2_6": 1931,
      "4_12_1_9": 1932,
      "5_11_0_9": 1933,
      "19_1": 1934,
      "4_10_2_4": 1935,
      "3_13_1_10": 1936,
      "5_10_2_10": 1937,
      "5_10_4_8": 1938,
      "16_18": 1939,
      "5_7_0_3": 1940,
      "5_9_0_6": 1941,
      "2_13_1_9": 1942,
      "5_12_3_8": 1943,
      "6_13_2_12": 1944,
      "6_11_4_9": 1945,
      "2_12_0_7": 1946,
      "5_15_2_14": 1947,
      "5_12_4_10": 1948,
      "0_13_0_6": 1949,
      "14_14_12_14": 1950,
      "20_9_": 1951,
      "4_15_3_15": 1952,
      "5_14_5_10": 1953,
      "5_15_3_13": 1954,
      "18_19_": 1955,
      "5_14_2_14": 1956,
      "6_14_3_12": 1957,
      "16_10_": 1958,
      "3_10_1_4": 1959,
      "0_15_0_9": 1960,
      "15_15_13_15": 1961,
      "3_5_0_0": 1962,
      "6_20_6_19": 1963,
      "7_15_7_15": 1964,
      "18_20_13_20": 1965,
      "3_11_1_6": 1966,
      "5_8_2_4": 1967,
      "4_17_4_14": 1968,
      "5_10_2_6": 1969,
      "0_14_0_7": 1970,
      "2_14_1_14": 1971,
      "2_19_2_16": 1972,
      "2_10_1_4": 1973,
      "3_12_1_8": 1974,
      "3_13_0_9": 1975,
      "3_12_2_7": 1976,
      "4_14_0_12": 1977,
      "5_10_5_9": 1978,
      "5_11_0_8": 1979,
      "1_15_1_10": 1980,
      "6_14_3_13": 1981,
      "14_20_8_20": 1982,
      "4_10_1_5": 1983,
      "5_10_3_6": 1984,
      "6_15_6_13": 1985,
      "1_11_1_4": 1986,
      "2_19_2_18": 1987,
      "4_7_1_7": 1988,
      "11_20_4_20": 1989,
      "2_14_0_10": 1990,
      "5_8_0_8": 1991,
      "6_10_4_8": 1992,
      "17_10_": 1993,
      "1_12_0_8": 1994,
      "3_7_3_7": 1995,
      "5_12_0_10": 1996,
      "5_12_4_9": 1997,
      "4_13_3_10": 1998,
      "4_15_0_14": 1999,
      "2_10_0_3": 2000,
      "4_12_3_8": 2001,
      "4_12_4_7": 2002,
      "5_13_2_13": 2003,
      "6_13_4_12": 2004,
      "1_19_1_16": 2005,
      "5_13_1_11": 2006,
      "5_18_5_16": 2007,
      "5_7_0_6": 2008,
      "19_15": 2009,
      "3_11_2_6": 2010,
      "5_10_5_8": 2011,
      "5_18_5_17": 2012,
      "0_19_0_18": 2013,
      "6_12_3_10": 2014,
      "2_11_0_5": 2015,
      "4_14_2_10": 2016,
      "4_14_3_11": 2017,
      "5_17_5_14": 2018,
      "17_14_": 2019,
      "2_15_0_12": 2020,
      "5_6_0_5": 2021,
      "5_9_3_9": 2022,
      "2_16_2_11": 2023,
      "6_11_3_9": 2024,
      "4_14_4_9": 2025,
      "6_14_6_11": 2026,
      "5_13_0_11": 2027,
      "5_9_0_9": 2028,
      "5_11_1_11": 2029,
      "5_8_2_8": 2030,
      "0_17_0_13": 2031,
      "1_11_0_6": 2032,
      "4_13_0_13": 2033,
      "5_12_2_8": 2034,
      "7_20_7_19": 2035,
      "15_15_11_15": 2036,
      "2_5_1_5": 2037,
      "4_15_2_12": 2038,
      "4_7_3_6": 2039,
      "0_10_0_2": 2040,
      "5_10_1_5": 2041,
      "5_15_4_15": 2042,
      "0_18_0_14": 2043,
      "3_13_2_9": 2044,
      "5_8_3_5": 2045,
      "5_14_4_11": 2046,
      "5_13_2_10": 2047,
      "5_13_4_10": 2048,
      "3_14_3_8": 2049,
      "3_17_3_13": 2050,
      "5_10_1_10": 2051,
      "1_16_1_11": 2052,
      "6_16_6_15": 2053,
      "18_16": 2054,
      "5_9_4_7": 2055,
      "6_13_6_12": 2056,
      "6_18_6_17": 2057,
      "1_8_1_2": 2058,
      "4_15_1_14": 2059,
      "4_15_4_11": 2060,
      "5_10_0_7": 2061,
      "5_11_0_11": 2062,
      "5_11_4_8": 2063,
      "4_15_2_15": 2064,
      "16_20_10_20": 2065,
      "3_20_3_16": 2066,
      "6_12_4_10": 2067,
      "2_16_2_12": 2068,
      "6_11_3_8": 2069,
      "5_7_2_5": 2070,
      "6_13_2_11": 2071,
      "3_17_3_17": 2072,
      "6_9_2_7": 2073,
      "4_15_0_13": 2074,
      "1_13_1_6": 2075,
      "4_16_2_15": 2076,
      "4_19_4_17": 2077,
      "5_15_3_14": 2078,
      "1_14_0_11": 2079,
      "2_5_2_4": 2080,
      "4_17_4_17": 2081,
      "5_20_5_16": 2082,
      "5_7_1_6": 2083,
      "15_20_9_20": 2084,
      "2_16_0_14": 2085,
      "5_8_0_3": 2086,
      "19_0": 2087,
      "2_13_0_8": 2088,
      "3_5_1_3": 2089,
      "4_9_3_5": 2090,
      "1_13_0_10": 2091,
      "3_12_0_7": 2092,
      "6_12_2_10": 2093,
      "6_13_4_11": 2094,
      "16_9_": 2095,
      "19_20_19_20": 2096,
      "6_14_2_12": 2097,
      "1_15_0_14": 2098,
      "3_11_0_5": 2099,
      "3_6_2_6": 2100,
      "4_13_2_9": 2101,
      "6_9_3_7": 2102,
      "0_6_0_1": 2103,
      "17_13_": 2104,
      "4_8_3_5": 2105,
      "5_10_3_5": 2106,
      "5_9_1_5": 2107,
      "6_12_6_11": 2108,
      "7_14_7_13": 2109,
      "17_12_": 2110,
      "6_14_4_14": 2111,
      "6_13_5_12": 2112,
      "17_17": 2113,
      "4_11_2_5": 2114,
      "6_13_6_11": 2115,
      "6_17_6_15": 2116,
      "3_11_1_5": 2117,
      "4_13_0_10": 2118,
      "4_19_4_18": 2119,
      "3_12_3_6": 2120,
      "3_17_2_16": 2121,
      "4_11_0_6": 2122,
      "19_20_13_20": 2123,
      "3_13_3_7": 2124,
      "4_16_3_15": 2125,
      "1_9_0_3": 2126,
      "11_20_3_20": 2127,
      "4_12_2_7": 2128,
      "5_15_2_13": 2129,
      "20_8_": 2130,
      "2_9_1_3": 2131,
      "0_19_0_16": 2132,
      "3_9_1_3": 2133,
      "5_15_2_15": 2134,
      "1_10_1_3": 2135,
      "4_11_1_6": 2136,
      "6_14_5_13": 2137,
      "10_20_2_20": 2138,
      "1_14_0_12": 2139,
      "5_6_0_3": 2140,
      "5_10_2_5": 2141,
      "6_14_6_12": 2142,
      "3_10_2_4": 2143,
      "3_6_2_3": 2144,
      "5_15_5_11": 2145,
      "5_9_1_9": 2146,
      "6_15_4_13": 2147,
      "1_12_1_5": 2148,
      "8_20_8_19": 2149,
      "15_20_8_20": 2150,
      "16_7_": 2151,
      "4_6_1_3": 2152,
      "5_12_1_12": 2153,
      "1_18_1_18": 2154,
      "4_16_1_15": 2155,
      "5_12_0_12": 2156,
      "6_11_1_10": 2157,
      "6_14_4_12": 2158,
      "15_15_12_15": 2159,
      "1_6_0_1": 2160,
      "2_6_2_3": 2161,
      "4_16_4_12": 2162,
      "5_10_0_10": 2163,
      "6_10_3_7": 2164,
      "1_18_1_14": 2165,
      "5_15_3_15": 2166,
      "5_10_4_7": 2167,
      "5_12_5_8": 2168,
      "5_8_0_2": 2169,
      "5_11_2_7": 2170,
      "5_12_1_9": 2171,
      "5_19_5_18": 2172,
      "0_5_0_1": 2173,
      "3_11_2_5": 2174,
      "5_7_1_5": 2175,
      "20_20_8_20": 2176,
      "3_7_1_2": 2177,
      "4_12_1_8": 2178,
      "3_15_3_10": 2179,
      "3_16_1_15": 2180,
      "5_10_1_6": 2181,
      "5_7_2_4": 2182,
      "6_18_6_16": 2183,
      "6_8_2_6": 2184,
      "5_14_0_13": 2185,
      "5_14_2_11": 2186,
      "6_10_4_9": 2187,
      "4_11_3_6": 2188,
